Repository: zhangyin-github2/Geomystery
Catalog: Geomystery/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# About Us.Text
source: About Us
zh_cn: 关于我们

# CD1
source: Learning is necessary before starting trail and challenge. You need to learn how to use rulers and compasses ,because they will help you to solve almost all of the problems .You also need to learn some kind of composite tools in this chapter.
zh_cn: 在进行试炼与挑战之前，学习是必要的。你需要学会使用直尺和圆规，几乎所有问题都要用到这两种工具，你也需要在本章节中学会使用一些复合工具……

# CD2
source: Dojo can teach you only the most basic knowledge. If you want to be a master, you have to cintinue your learning in the course of trail and challenge.You can only rely on yourself.
zh_cn: 道场能教给你的只是最基础的知识，如果想成为大师，你还需要在试炼和挑战的路上不断学习，你能依靠的只有你自己……

# Chapter1.Content
source: Chapter1
zh_cn: 第一章节

# Chapter2.Content
source: Chapter2
zh_cn: 第二章节

# Chapter3.Content
source: Chapter3
zh_cn: 第三章节

# CN1
source: Dojo of Geometry
zh_cn: 几何学习道场

# CN2
source: Coloseum of Geometry
zh_cn: 几何试炼之地

# CN3
source: Valhalla of Geometry
zh_cn: 几何挑战圣殿

# Freestyle.Content
source: Freestyle
zh_cn: 自由模式

# Fullscreen.Text
source: Fullscreen
zh_cn: 全屏

# Game.Content
source: Game
zh_cn: 游戏模式

# Language.Text
source: Language
zh_cn: 语言

# LanguageNow.Text
source: English
zh_cn: 简体中文

# Music Volume.Text
source: Music Volume
zh_cn: 音乐音量

# NEXTLEVEL
source: Next Problem!
zh_cn: 下一关

# Night Mode.Text
source: Night Mode
zh_cn: 夜间模式

# Option.Content
source: Option
zh_cn: 设置

# PLAYAGAIN
source: Stay Here！
zh_cn: 再试一次

# Reset Progress.Text
source: Reset Progress
zh_cn: 重制游戏进度

# SFX Volume.Text
source: SFX Volume
zh_cn: 音效音量

# L1D
source: Today you need to take the first step in geometric learning,why not get started from the most simple content.Try to draw three lines to connect these three points .Line is one of the most useful tools you will use to solve problems ,you must comprehend it.
zh_cn: 今天你需要迈出几何学习的第一步，我们不妨从最简单的学起。试着用三条直线连接这三个点，直线是你以后最常用的工具，你必须掌握它……

# L1N
source: Draw Line
zh_cn: 以线连点

# L2D
source: Lines can't help you with solving all of the question when you learn geometry,so why not try to use circles ? Try to draw two concentric circles through the other two points with a given point which is above the others as the center.This question is not too difficult ,is it?
zh_cn: 在几何学习的路上，直线不能帮助你解决所有问题，那我们何不试试圆？试着以给定三点中最上方的点为圆心画出经过其他两点的两个同心圆，这没有那么困难,是吧？

# L2N
source: Draw Circle
zh_cn: 同心圆

# L3D
source: It seems that you have learned to use straight lines and rounds, which is really gratifying.But sometimes you need some points to help you.Try to mark the intersection of the given three lines,and this step will be used repeatedly.
zh_cn: 看起来你已经学会使用直线和圆了，这实在可喜可贺。不过有些时候，你需要一些点来辅助你。试着标出给定的三条直线的交点，这个步骤你以后需要经常用到……

# L3N
source: Draw Point
zh_cn: 求交点

# L4D
source: Have you already learnt the three basic tools?It seems that you are ready to accept the first test. Try to draw a 60° angle in the counterclockwise direction of the given line through the given point , I think it's not hard for you.
zh_cn: 你已经学会使用三种基本工具了？看来你已经准备好接受第一个测试了。尝试着基于给定的射线画出一个60°的角，我想这难不倒你吧？

# L4N
source: Angle of 60°
zh_cn: 画60°角

# L5D
source: It is a long way to lern geometry ,don't be complacent. You need to learn how to use more tools which is more complex.Try to draw the perpendicular bisector of this line. What's more ,mastered perpendicular bisectors is obligatory course if you want to learn to solve problems.
zh_cn: 几何学习的路还很长，先别沾沾自喜。你需要学会更多更复杂的工具，试着画出这个线段的垂直平分线。补充一句，熟练地掌握垂直平分线是你学会解决难题的必修课……

# L5N
source: Perpendicular Bisector
zh_cn: 垂直平分线

# L6D
source: Do you remember the 60 degree angle you have drawn? The line isn't the only object we have to operate, we need to learn to operate angle.Try to draw the bisector of the given angle. You will learn more about the relationship between the lines and the angles.
zh_cn: 还记得你画的60°角么？几何学习的过程中，线不是我们唯一要操作的对象，我们还要面对“角”。试着画出给定角的角平分线，你可能会更进一步理解线与角的关系……

# L6N
source: Angle Bisector
zh_cn: 角平分线

# L7D
source: Have you already mastered perpendicular bisectors and angle bisectors ?I think you are ready to continue your learning in using composite tools. Try to draw the perpendicular line of the given line through the given point. Can you see the nature of this problem?
zh_cn: 垂直平分线和角平分线已经掌握了？我想你已经准备好下一步复合工具的学习了。试着过给定点画出这条直线的垂线，不知道你是否能看出这个问题的本质……

# L7N
source: Perpendicular Line
zh_cn: 垂线

# L8D
source: Finished learning to use composite tool , maybe you are eager to do a quiz. Are you ready to do it? Try to draw the inscribed circle of the given diamond. Don't forget to use the new tools you have lerant to help you.
zh_cn: 结束了复合工具的学习，我想你已经跃跃欲试了，不知道你是否准备好迎接新测试了。试着画出给定菱形的内切圆，不要忘了你学到的新工具……

# L8N
source: Circle in Diamond
zh_cn: 菱形内切圆

# L9D
source: I think these simple problems can not stumped you, you need a final quiz before starting your test. Try to draw the center of the given circle. This question is not as simple as it looks.
zh_cn: 相信这些简单的谜题已经难不住你了，在你开始你的试炼之路前，你还需要进行一次测试来证明自己.试着标出已知圆的圆心，这个问题可不像它看起来的一样简单……

# L9N
source: Circle Center
zh_cn: 求圆心

# L10N
source: Parallel Lines
zh_cn: 平行线

# L11N
source: Tangent
zh_cn: 切线

# L12N
source: Angle of 60°Again
zh_cn: 再次完成60°角

# L13N
source: Circumscribed Equilateral Triangle
zh_cn: 外切正三角形

# L14N
source: Trapezoidal Median Line
zh_cn: 梯形中位线

# L15N
source: Cut Rectangle
zh_cn: 平分矩形

# L16N
source: Triangle in Circle
zh_cn: 三角形的外接圆

# L17N
source: Circle in Triangle
zh_cn: 三角形的内切圆

# L18N
source: Regular Hexagon
zh_cn: 正六边形

# L10D
source: It seems that you are ready for your trail . As you can see ,there is a line .Draw a parallel line through the given point of the given line.
zh_cn: 看来你已经准备好开始试炼了。如你所见，现在有一条直线。你的任务是过给定点画出给定直线的平行直线。

# L11D
source: As you can see ,you operation object is a circle .Draw the tangent through the given point of the given circle .
zh_cn: 如你所见，你的操作对象是一个圆。你的任务是画出给定圆在给定点位置的切线。

# L12D
source: As you can see ,this problem seems to have met before , but they are completely different in fact .Draw a 60° angle at a given point in the counterclockwise direction of a given line .
zh_cn: 如你所见，这道题似曾相识，但实际上二者完全不同。你的任务是在给定直线的逆时针方向上过给定点画出一个60°角。

# L13D
source: As you can see, you need to finish one more problem about circle. Draw a circumscribed equilateral triangle through the given point of the given circle.
zh_cn: 如你所见，你需要继续完成一个关于圆的问题。你的任务是过给定点画出给定圆的外切正三角形。

# L14D
source: As you can see ,this is a trapezoidal ,you will meet it in the future.Draw the median line of the given trapezoidal.
zh_cn: 如你所见，这是一个梯形，你以后还会再见到它。你的任务是画出给定梯形的中位线。

# L15D
source: As you can see ,your operation object is a rectangle .Draw a line through the given point that cuts the rectangle into two parts of equal area.
zh_cn: 如你所见，这次你的操作对象变成了一个矩形。你的任务是过矩形外的给定点画出一条线将给定切割成面积相等的两部分。

# L16D
source: As you can see ,your operation object is a triangle .Draw the Circumcircle of the given triangle.
zh_cn: 如你所见，这次你的操作对象是一个三角形。你的任务是画出给定三角形的外接圆。

# L17D
source: As you can see ,this problem is similar as previous one ,but they are totally opposite .Draw the inscribed circle of the given triangle.
zh_cn: 如你所见，这个问题与上个问题很像，不过它们完全相反。你的任务是画出给定三角形的内切圆。

# L18D
source: It seems that you have already passed the trial before .Now ,you can try to construct a new gragh,why not draw a regular hexagon ?Draw a regular hexagon above the given line with using the given line as one of it's side.
zh_cn: 看来你已经通过了前面的试炼。现在你可以尝试着构建一个新图形，何不试试一个正六边形？你的任务是以给定线段为正六边形的一边，在给定线段上方画一个正六边形。

# AC1D
source: Solve your first problem.
zh_cn: 完成了你的第一关，开启了你的解题之旅。

# AC1N
source: First Try
zh_cn: 牛刀小试

# AC2D
source: Finish the 1st chapter.
zh_cn: 通关第一章。

# AC2N
source: Graduation
zh_cn: 初出茅庐

# AC3D
source: Finish the 2nd chapter.
zh_cn: 通关第二章。

# AC3N
source: Finish Trail
zh_cn: 进阶之路

# AC4D
source: Unlock all problems.
zh_cn: 解锁全部关卡。

# AC4N
source: Elite Player
zh_cn: 解题狂人

# AC5D
source: Solve all problems.
zh_cn: 通关所有章节。

# AC5N
source: Geometricist
zh_cn: 几何学家

# AC6D
source: Solve all problems perfectly.
zh_cn: 完美通过所有关卡。

# AC6N
source: Lengend of Geometry
zh_cn: 一代宗师

# AreYouSure
source: Please confirm whether you want to reset all your game progress?
zh_cn: 请确认您是否要重置游戏的所有进程？

source: Cancel
zh_cn: 取消

source: Confirm
zh_cn: 确认

source: Congratulations!
zh_cn: 恭喜过关！

source: Problem solved!
zh_cn: 完美通过

source: Warnning
zh_cn: 警告！
